"""Check Thai"""

def check_thai():
    """Check Thai"""
    text = input()
    alphabet_no_shift = ['ๅ', '/', '-', 'ภ', 'ถ', 'ุ', 'ึ', 'ค', 'ต', 'จ', 'ข', 'ช',\
         'ๆ', 'ไ', 'ำ', 'พ', 'ะ', 'ั', 'ี', 'ร', 'น', 'ย', 'บ', 'ล', 'ฃ', 'ฟ',\
         'ห', 'ก', 'ด', 'เ', '้', '่', 'า', 'ส', 'ว', 'ง', 'ผ', 'ป','แ',\
         'อ', 'ิ', 'ื', 'ท', 'ม', 'ใ', 'ฝ', '_']
    alphabet_shift = ['+', '๑', '๒', '๓', '๔', 'ู', '฿', '๕', '๖', '๗', '๘', '๙',\
         '๐', '"', 'ฎ', 'ฑ' ,'ธ' ,'ํ' ,'๊' ,'ณ', 'ฯ', 'ญ', 'ฐ', ',', 'ฅ', 'ฤ',\
         'ฆ', 'ฏ', 'โ', 'ฌ', '็', '๋', 'ษ', 'ศ', 'ซ', '.', '(',\
         ')', 'ฉ', 'ฮ', 'ฺ', '์', '?', 'ฒ', 'ฬ', 'ฦ', '%']
    for i in text:
        if i in alphabet_no_shift:
            print('TH NO SHIFT')
        elif i in alphabet_shift:
            print('TH SHIFT')
        elif i == ' ':
            print(' ')
        else:
            print('OTHER LANGUAGES')

check_thai()
